  "use strict"
  class Question{
    constructor(content , sulotion , op1 , op2 , op3 , op4){
      this.content = content;
      this.sulotion= sulotion;
      this.op1 = op1;
      this.op2 = op2;
      this.op3 = op3;
      this.op4 = op4;
    }
  }

  var content1 = "تتمثل أدوات تقديم الذات الأساسية فيما يلي ";
  var sulotion1 ="كل ما سبق";
  var op11 ="السيرة الذاتية";
  var op21 ="المقابلات الشخصية";
  var op31 ="كل ما سبق";
  var op41 ="العروض المرئية";

  var content2 = "من الوسائل الالكترونية المساعدة في تسويق الذات ما يلي  ";
  var sulotion2="الاشتراك في شركات التوظيف الموجودة على شبكات وبرامج الانترنت";
  var op12 ="الاشتراك في شركات التوظيف الموجودة على شبكات وبرامج الانترنت";
  var op22 ="الاشتراك في المجموعات البريدية الخاصة بالباحثين عن وظائف";
  var op32 ="متابعة الصحف والمواقع والمجلات لتتبع الشركات التي تبحث عن موظفين";
  var op42 ="التوجه الى الشركات وتقديم سيرتك الذاتية حتى وإن لم تكن طالبه وظائف الآن";

  var content3 = "عندما تقوم بتسويق نفسك بشكل جيد فيجب أن يكون ذلك من منطلق";
  var sulotion3 ="وجود منافسين لك وإنك لست الوحيد في مجالك";
  var op13 ="أنك تملك ميزات مطلقة عن الآخرين التقليل من القراءة";
  var op23 ="وجود منافسين لك وإنك لست الوحيد في مجالك";
  var op33 ="عدم وجود منافسين لك";
  var op43 =" يكفى أن تكون شبيه بمنافسيك";

  var content4 =  "يمكنك الحصول على فرص عمل أكثر أثناء مرحلة البحث عن تلك الفرص من خلال";
  var sulotion4 = "تسويق ذاتك كل فترة كي يكون الآخرين متابعين لك ومدركين لقدراتك";
  var op14 ="تسويق ذاتك لمرة واحدة فقط";
  var op24 ="تسويق ذاتك كل فترة كي يكون الآخرين متابعين لك ومدركين لقدراتك";
  var op34 ="تضييق دائرة معارفك";
  var op44 ="عدم مشاركة أحد غيرك في تسويق ذاتك";

  var q1 = new Question(content1, sulotion1, op11,  op21,  op31 , op41);
  var q2 = new Question(content2, sulotion2, op12 , op22,  op32 , op42);
  var q3 = new Question(content3, sulotion3, op13 , op23,  op33 , op43);
  var q4 = new Question(content4, sulotion4, op14,  op24,  op34 , op44);

  const questions = [q1 , q2 , q3 ,q4];
