  "use strict"
  class Question{
    constructor(content , sulotion , op1 , op2 , op3 , op4){
      this.content = content;
      this.sulotion= sulotion;
      this.op1 = op1;
      this.op2 = op2;
      this.op3 = op3;
      this.op4 = op4;
    }
  }

  var content1 = "عندما تجيب على أسئلة المقابلة الشخصية فيجب أن تجيب بطريقة وقت التقديم للوظيفة فقط";
  var sulotion1 ="تلقائية وعبر عن نفسك بثقة";
  var op11 ="مرتبكة تنم عن عدم الثقة بالنفس ";
  var op21 ="تلقائية وعبر عن نفسك بثقة";
  var op31 ="مرتبة أكثر من اللازم";
  var op41 ="عشوائية";

  var content2 = "ينبغي عليك عندما تسأل عن طبيعة علاقتك بمديرك السابق أثناء المقابلة الشخصية أن تقوم";
  var sulotion2="أن تذكره بالخير على المستوى المهني مهما كان بينكم من خلاف ولكنك تعلمت منه";
  var op12 ="بالمبالغة في ذمه بما هو فيه وما ليس فيه من صفات سيئة";
  var op22 ="أن تذكره بالخير على المستوى المهني مهما كان بينكم من خلاف ولكنك تعلمت منه";
  var op32 ="بذمه بما ليس هو موجود فيه";
  var op42 ="أن تبدأ على الفور بذكر صفاته السيئة";

  var content3 = 'أثناء المقابلة الشخصية لكى تتمكن من الإجابة على السؤال التالي " ما هي بيئة العمل المثالية لك؟ " ينبغي أن تمتلك معلومات عن ';
  var sulotion3 ="الشركة التي تتقدم لها وبيئتها الداخلية";
  var op13 ="الشركات المنافسة للشركة المتقدم لها";
  var op23 ="ما تحلم بوجوده في بيئة العمل";
  var op33 ="الشركة التي تتقدم لها وبيئتها الداخلية";
  var op43 ="مهارات وقدراتك الشخصية";

  var content4 =  "من بين الأمور التي يجب أن تنتبه لها أثناء المقابلة الشخصية ما يلي وقت التقديم للوظيفة فقط";
  var sulotion4 = "الاهتمام بلغة الجسد سواء لك أو لمن يقوم بالمقابلة";
  var op14 ="التركيز على الكلمات المنطوقة فقط";
  var op24 ="الاهتمام بلغة الجسد سواء لك أو لمن يقوم بالمقابلة";
  var op34 ="عدم الاهتمام بلغة الجسد الخاصة بك";
  var op44 ="عدم الاهتمام بلغة الجسد لمن يقوم بعمل المقابلة معك";

  var q1 = new Question(content1, sulotion1, op11,  op21,  op31 , op41);
  var q2 = new Question(content2, sulotion2, op12 , op22,  op32 , op42);
  var q3 = new Question(content3, sulotion3, op13 , op23,  op33 , op43);
  var q4 = new Question(content4, sulotion4, op14,  op24,  op34 , op44);

  const questions = [q1 , q2 , q3 ,q4];

