  "use strict"
  class Question{
    constructor(content , sulotion , op1 , op2 , op3 , op4){
      this.content = content;
      this.sulotion= sulotion;
      this.op1 = op1;
      this.op2 = op2;
      this.op3 = op3;
      this.op4 = op4;
    }
  }

  var content1 = "ينبغي أن تبدأ في كتابة السيرة الذاتية الخاصة بك";
  var sulotion1 ="يجب أن تبدأ في كتابتها من اللحظة التي يمكنك فيها معنى كتابتها";
  var op11 ="وقت التقديم للوظيفة فقط";
  var op21 ="بعد التخرج";
  var op31 ="يجب أن تبدأ في كتابتها من اللحظة التي يمكنك فيها معنى كتابتها";
  var op41 ="بعد قراءة اعلان الوظيفة";

  var content2 = "تتمثل عناصر السيرة الذاتية فيما يلي";
  var sulotion2="المعلومات الشخصية والمؤهلات العلمية والدورات التدريبية والخبرات العملية";
  var op12 ="المعلومات الشخصية والمؤهلات العلمية فقط";
  var op22 ="المعلومات الشخصية والدورات التدريبية فقط";
  var op32 ="المعلومات الشخصية والمؤهلات العلمية والدورات التدريبية والخبرات العملية";
  var op42 ="المؤهلات والخبرات العملية فقط";

  var content3 = "من ضمن خصائص السيرة الذاتية القوية ما يلي";
  var sulotion3 ="الاختصار والبساطة";
  var op13 ="الاختصاروالتعقيد الانعزال عن الناس";
  var op23 ="الإطالة والتعقيد";
  var op33 ="الاختصار والبساطة";
  var op43 ="الإطالة مع الاهتمام بالتفاصيل";

  var content4 =  "عند التوجه إلى الشركات لترك سيرتك الذاتية لتسويق ذاتك والحصول على وظيفة , فعليك التوجه إلى";
  var sulotion4 = "جميع الشركات الصغيرة والكبيرة والطالبة وظائف وغير الطالبة لوظائف حالياً";
  var op14 ="جميع الشركات الصغيرة والكبيرة والطالبة وظائف وغير الطالبة لوظائف حالياً";
  var op24 ="الشركات طالبة وظائف فقط";
  var op34 ="الشركات الكبيرة فقط  تجنب التعامل مع الناس";
  var op44 ="الشركات الصغيرة فقط";

  var q1 = new Question(content1, sulotion1, op11,  op21,  op31 , op41);
  var q2 = new Question(content2, sulotion2, op12 , op22,  op32 , op42);
  var q3 = new Question(content3, sulotion3, op13 , op23,  op33 , op43);
  var q4 = new Question(content4, sulotion4, op14,  op24,  op34 , op44);

  const questions = [q1 , q2 , q3 ,q4];

